## Imports

In [1]:
import pandas as pd 
import numpy as np

## Load Datasets

In [2]:
# load arabic names
real_arabic_names = pd.read_csv('Names web dataset/Arabic_names.csv')
# load male names
male = pd.read_csv('Names web dataset/mnames.txt', sep='\n', header=None, names=['Name'])
# load female names
female = pd.read_csv('Names web dataset/fnames.txt', sep='\n', header=None, names=['Name'])

In [3]:
# view first rows of real arabic names
real_arabic_names.head()

     Name Gender
0  ابتسام      F
1  ابتهاج      F
2  ابتهال      F
3  اجتهاد      F
4  ازدهار      F

In [4]:
# view last 5 rows of arabic names
real_arabic_names.tail()

       Name Gender
1400   وهبة      M
1401   ياسر      M
1402   يحيى      M
1403   يزيد      M
1404  يعقوب      M

In [5]:
# view first 5 rows of male names
male.head()

       Name
0      أبان
1   أبو بكر
2  أبو حمزة
3       أحد
4      أحمد

In [6]:
# view last 5 rows of male names
male.tail()

     Name
635  وفيق
636  وهاب
637  وهبة
638  ياسر
639  يحيى

In [7]:
# view first 5 rows of female names
female.head()

   Name
0  آيات
1  آلاء
2  آمال
3  آمنة
4  آيات

In [8]:
# view last 5 rows of female names
female.tail()

       Name
411    وميض
412    وهبة
413    يارا
414  ياسمين
415    يسرا

In [9]:
# add gender column to male and female names
male['Gender'] = 'M'
female['Gender'] = 'F'

In [10]:
# merge male names with female names
names = pd.concat([male,female])
# merge the result with arabic names
real_names = pd.concat([real_arabic_names,names])

In [11]:
# add label column to the arabic names datasets that identifies that these names are real names
real_names['Label'] = 'Real'

In [12]:
# shape of the result of merging all real arabic names datasets
real_names.shape

(2461, 3)

In [13]:
# check to see if there is duplicates in rows
print('Number of duplicated names are: ', real_names['Name'].duplicated().sum())
# create mask
duplicated_names_mask = real_names['Name'].duplicated()
# new arabic names dataframe without any duplicated names
names = real_names[~ duplicated_names_mask]
print('The shape of the final arabic names is', names.shape)

Number of duplicated names are:  909
The shape of the final arabic names is (1552, 3)

In [14]:
names.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1552 entries, 0 to 385
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    1552 non-null   object
 1   Gender  1552 non-null   object
 2   Label   1552 non-null   object
dtypes: object(3)
memory usage: 48.5+ KB

In [15]:
names.describe()

        Name Gender Label
count   1552   1552  1552
unique  1552      2     1
top     جناح      M  Real
freq       1    929  1552

## Data generation

In [19]:
arabic_alphabet = ['ا', 'ب', 'ت', 'ث', 'ج', 'ح', 'خ', 'د', 'ذ', 'ر', 'ز', 'س', 'ش', 'ص', 'ض', 'ط', 
                     'ظ', 'ع', 'غ', 'ف', 'ق', 'ك', 'ل', 'م', 'ن', 'ه', 'و', 'ي', 'أ', 'ؤ', 
                     'ة', 'آ', 'ء', 'ئ', 'إ']